{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "54d63193",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install wikipedia-api neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "1539dacd",
   "metadata": {},
   "outputs": [],
   "source": [
    "#!pip install openai"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "556de898",
   "metadata": {},
   "outputs": [],
   "source": [
    "import wikipediaapi\n",
    "from neo4j import GraphDatabase\n",
    "from openai import OpenAI\n",
    "import re\n",
    "import os\n",
    "client = OpenAI(api_key=os.getenv(\"OPENAI_API_KEY\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a923b0a1",
   "metadata": {},
   "source": [
    "### LLM NER Function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c918ec02",
   "metadata": {},
   "outputs": [],
   "source": [
    "def extract_entities(text):\n",
    "    prompt = f\"\"\"\n",
    "    Extract entities and their types from the following text: \\n\\n{text}\\n\\n\n",
    "    Format: Entity - Type (e.g. John Doe - Person)\n",
    "    \"\"\"\n",
    "    response = client.chat.completions.create(\n",
    "        model = \"gpt-5-nano\",\n",
    "        messages = [\n",
    "            {\"role\": \"user\", \"content\": prompt}\n",
    "        ],\n",
    "    )\n",
    "    return response.choices[0].message.content.strip()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a3de68db",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "John Doe - Person\n",
      "Google - Organization\n",
      "MIT - Organization\n",
      "Computer Science - Field\n",
      "software engineer - Occupation\n"
     ]
    }
   ],
   "source": [
    "test_text = \"John Doe is a software engineer at Google and has a degree in Computer Science from MIT.\"\n",
    "print(extract_entities(test_text))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "023888fa",
   "metadata": {},
   "source": [
    "### NEO4J Connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "bef94a24",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Copied from Neo4j Sandbox\n",
    "uri = \"bolt://44.202.44.181:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"retractor-hand-washing\"\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "26c6bf73",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_node(tx, label, name):\n",
    "    query = f\"MERGE (n:{label} {{name: $name}})\"\n",
    "    tx.run(query, name=name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "1d4bf58d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_relationship(tx, entity1, entity2, relationship):\n",
    "    query = f\"\"\"\n",
    "    MATCH (a {{name: $entity1}}), (b {{name: $entity2}})\n",
    "    MERGE (a) - [r:{relationship}] -> (b)\n",
    "    RETURN type(r)\n",
    "    \"\"\"\n",
    "    tx.run(query, entity1=entity1, entity2=entity2)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a402bc6e",
   "metadata": {},
   "source": [
    "### FETCH WIKIPEDIA Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "64096e5c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Text from Artificial Intelligence: Artificial intelligence (AI) is the capability of computational systems to perform tasks typically a\n"
     ]
    }
   ],
   "source": [
    "wiki = wikipediaapi.Wikipedia(language='en', user_agent=\"my_bot (abc@example.com)\")\n",
    "page_title = \"Artificial Intelligence\"\n",
    "page = wiki.page(page_title)\n",
    "if page.exists():\n",
    "    wiki_text = page.text\n",
    "    print(f\"Text from {page_title}: {wiki_text[:100]}\")\n",
    "else:\n",
    "    print(f\"{page_title} does not exist\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "3e129d08",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Entities extracted from text: \n",
      "Artificial intelligence - Concept\n",
      "AI - Acronym\n",
      "Google Search - Product\n",
      "YouTube - Organization\n",
      "Amazon - Organization\n",
      "Netflix - Organization\n",
      "Google Assistant - Product\n",
      "Siri - Product\n",
      "Alexa - Product\n",
      "Waymo - Organization\n",
      "language models - Technology\n",
      "AI art - Concept\n",
      "chess - Game\n",
      "Go - Game\n",
      "autonomous vehicles - Concept\n"
     ]
    }
   ],
   "source": [
    "entities_text = extract_entities(wiki_text[:1000]) # capped for demo\n",
    "print(f\"Entities extracted from text: \\n{entities_text}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "88bfda9f",
   "metadata": {},
   "source": [
    "### PARSE and CLEAN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "db093584",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('Artificial intelligence', 'Concept'),\n",
       " ('AI', 'Acronym'),\n",
       " ('Google Search', 'Product'),\n",
       " ('YouTube', 'Organization'),\n",
       " ('Amazon', 'Organization'),\n",
       " ('Netflix', 'Organization'),\n",
       " ('Google Assistant', 'Product'),\n",
       " ('Siri', 'Product'),\n",
       " ('Alexa', 'Product'),\n",
       " ('Waymo', 'Organization'),\n",
       " ('language models', 'Technology'),\n",
       " ('AI art', 'Concept'),\n",
       " ('chess', 'Game'),\n",
       " ('Go', 'Game'),\n",
       " ('autonomous vehicles', 'Concept')]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def clean_entity_name(entity_name):\n",
    "    return re.sub(r\"^\\d+\\.\\s*\",\"\",entity_name).strip()\n",
    "\n",
    "def parse_entities(entities_text):\n",
    "    entity_pattern = r\"(.+) - (.+)\"\n",
    "    entities = []\n",
    "    for line in entities_text.split(\"\\n\"):\n",
    "        match = re.match(entity_pattern, line)\n",
    "        if match:\n",
    "            entity_name, entity_type = match.groups()\n",
    "            entity_name = clean_entity_name(entity_name)\n",
    "            entities.append((entity_name, entity_type.strip()))\n",
    "    return entities\n",
    "\n",
    "entities = parse_entities(entities_text)\n",
    "entities"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d1972de5",
   "metadata": {},
   "source": [
    "### Create Nodes and Relationships in NEO4J"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "d434ba1c",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session() as session:\n",
    "    for i, (entity_name, entity_type) in enumerate(entities):\n",
    "        session.execute_write(create_node, entity_type, entity_name)\n",
    "\n",
    "        for j, (entity_name2, entity_type2) in enumerate(entities):\n",
    "            if i!=j:\n",
    "                if entity_type == \"Application\" and entity_type2 == \"Concept\":\n",
    "                    session.execute_write(create_relationship, entity_name, entity_name2, \"APPLIES_TO\")\n",
    "                if entity_type == \"Acronym\" and entity_type2 == \"Concept\":\n",
    "                    session.execute_write(create_relationship, entity_name, entity_name2, \"ABBREVIATION_OF\")\n",
    "                if entity_type == \"Technology\" and entity_type2 == \"Concept\":\n",
    "                    session.execute_write(create_relationship, entity_name, entity_name2, \"ENABLES\")\n",
    "                if entity_type == \"Concept\" and entity_type2 == \"Game\":\n",
    "                    session.execute_write(create_relationship, entity_name, entity_name2, \"APPLIED_IN\")\n",
    "                if entity_type == \"Organization\" and entity_type2 == \"Concept\":\n",
    "                    session.execute_write(create_relationship, entity_name, entity_name2, \"USES\")\n",
    "                if entity_type == \"Product\" and entity_type2 == \"Technology\":\n",
    "                    session.execute_write(create_relationship, entity_name, entity_name2, \"POWERED_BY\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "00893c2d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record concept='Artificial intelligence' acronym='AI'>\n"
     ]
    }
   ],
   "source": [
    "# query the graph\n",
    "read_query = \"\"\"\n",
    "MATCH (ac: Acronym) - [:ABBREVIATION_OF] -> (c: Concept)\n",
    "RETURN c.name as concept, ac.name as acronym\n",
    "\"\"\"\n",
    "with driver.session() as session:\n",
    "    data = session.run(read_query)\n",
    "    for record in data:\n",
    "        print(record)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
